InformationRegisters/лб_СвязьУслугИДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>лб_СвязьУслугИДоговоровКонтрагентов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДоговорСКонтрагентом</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ОтветственныеЛицаПоКУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ОтветственныеЛицаПоКУ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/бит_ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемПрефикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВестиРасчетПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьПоГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛицевогоСчетаГИСЖКХ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипЛицевогоСчетаГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УлицаЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Льготный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/лб_СвязьУслугИДоговоровКонтрагентов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Функция ЛицевойСчетПриИзмененииНаСервере(ВыбранныйЛицевойСчет, Строка)
	Запрос = Новый Запрос;
	Если Строка = "Контрагент" Тогда
		НайденныйКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
		Запрос.Текст = "ВЫБРАТЬ
	                   |	бит_ОтветственныеЛицаПоКУСрезПоследних.Контрагент КАК Контрагент
	                   |ИЗ
	                   |	РегистрСведений.бит_ОтветственныеЛицаПоКУ.СрезПоследних КАК бит_ОтветственныеЛицаПоКУСрезПоследних
	                   |ГДЕ
	                   |	бит_ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет = &ЛицевойСчет";
		Запрос.УстановитьПараметр("ЛицевойСчет", ВыбранныйЛицевойСчет);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НайденныйКонтрагент = Выборка.Контрагент;
		КонецЦикла;
		Возврат НайденныйКонтрагент;
	ИначеЕсли Строка = "Адрес" Тогда
		НайденныйАдрес = Справочники.бит_СписокЗданий.ПустаяСсылка();
		Запрос.Текст = "ВЫБРАТЬ
		               |	бит_ЛицевыеСчета.Здание КАК Здание
		               |ИЗ
		               |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		               |ГДЕ
		               |	бит_ЛицевыеСчета.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ВыбранныйЛицевойСчет);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НайденныйАдрес = Выборка.Здание;
		КонецЦикла;
		Возврат НайденныйАдрес;
	ИначеЕсли Строка = "Квартира" Тогда
		НайденнаяКвартира = Справочники.бит_Квартиры.ПустаяСсылка();
		Запрос.Текст = "ВЫБРАТЬ
		               |	бит_ЛицевыеСчета.Квартира КАК Квартира
		               |ИЗ
		               |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		               |ГДЕ
		               |	бит_ЛицевыеСчета.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ВыбранныйЛицевойСчет);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НайденнаяКвартира = Выборка.Квартира;
		КонецЦикла;
		Возврат НайденнаяКвартира;
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	ВыбранныйЛицевойСчет = ЭтаФорма.Запись.ЛицевойСчет;
	ЭтаФорма.Запись.Адрес = ЛицевойСчетПриИзмененииНаСервере(ВыбранныйЛицевойСчет, "Адрес");
	ЭтаФорма.Запись.Квартира = ЛицевойСчетПриИзмененииНаСервере(ВыбранныйЛицевойСчет, "Квартира");
	ЭтаФорма.Запись.Контрагент = ЛицевойСчетПриИзмененииНаСервере(ВыбранныйЛицевойСчет, "Контрагент");
КонецПроцедуры

&НаСервере
Функция КвартираПриИзмененииНаСервере(ВыбранныйАдрес, ВыбраннаяКвартира, Строка)
	Запрос = Новый Запрос;
	Если Строка = "ЛицевойСчет" Тогда
		НайденныйЛицевойСчет = Справочники.бит_ЛицевыеСчета.ПустаяСсылка();
		Запрос.Текст = "ВЫБРАТЬ
		               |	бит_ЛицевыеСчета.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		               |ГДЕ
		               |	бит_ЛицевыеСчета.Здание = &Здание
		               |	И бит_ЛицевыеСчета.Квартира = &Квартира";
		Запрос.УстановитьПараметр("Здание", ВыбранныйАдрес);
		Запрос.УстановитьПараметр("Квартира", ВыбраннаяКвартира);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НайденныйЛицевойСчет = Выборка.Ссылка;
		КонецЦикла;
		Возврат НайденныйЛицевойСчет;
	ИначеЕсли Строка = "Контрагент" Тогда
		НайденныйКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
		Запрос.Текст = "ВЫБРАТЬ
		               |	бит_ОтветственныеЛицаПоКУСрезПоследних.Контрагент КАК Контрагент
		               |ИЗ
		               |	РегистрСведений.бит_ОтветственныеЛицаПоКУ.СрезПоследних КАК бит_ОтветственныеЛицаПоКУСрезПоследних
		               |ГДЕ
		               |	бит_ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет.Здание = &Здание
		               |	И бит_ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет.Квартира = &Квартира";
		Запрос.УстановитьПараметр("Здание", ВыбранныйАдрес);
		Запрос.УстановитьПараметр("Квартира", ВыбраннаяКвартира);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НайденныйКонтрагент = Выборка.Контрагент;
		КонецЦикла;
		Возврат НайденныйКонтрагент;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	Если Не ЭтаФорма.Запись.Адрес.Пустая() Тогда
		ВыбранныйАдрес = ЭтаФорма.Запись.Адрес;
		ВыбраннаяКвартира = ЭтаФорма.Запись.Квартира;
		ЭтаФорма.Запись.ЛицевойСчет = КвартираПриИзмененииНаСервере(ВыбранныйАдрес, ВыбраннаяКвартира, "ЛицевойСчет");
		ЭтаФорма.Запись.Контрагент  = КвартираПриИзмененииНаСервере(ВыбранныйАдрес, ВыбраннаяКвартира, "Контрагент");
	КонецЕсли;
КонецПроцедуры

//&НаКлиенте
//Процедура КвартираНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь;
//	
//	ПараметрыФормы = Новый Структура;
//	
//	Отборы = Новый Структура;
//	Отборы.Вставить("Владелец", ЭтаФорма.Запись.Адрес);	
//	
//	ПараметрыФормы.Вставить("Отбор", Отборы);
//	
//	ОткрытьФорму("Справочник.бит_Квартиры.Форма.ФормаВыбораУправляемая", ПараметрыФормы);
//КонецПроцедуры

//&НаКлиенте
//Процедура ДоговорСКонтрагентомНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь;
//	
//	ПараметрыФормы = Новый Структура;
//	
//	Отборы = Новый Структура;
//	Отборы.Вставить("Владелец", ЭтаФорма.Запись.Контрагент);	
//	
//	ПараметрыФормы.Вставить("Отбор", Отборы);
//	Форма = ПолучитьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыФормы);
//	Форма.Открыть();
//	//ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыФормы);
//КонецПроцедуры
